#Task 3

In [1]:
import pandas as pd

In [3]:
#load the data
dup_data = pd.read_csv("C://Users/user/Desktop/Internship_Task/data_scientist_duplicate_detection.csv")
print(dup_data.head())

        id                 name  \
0  1501006         QA Education
1  1370997  Seeking Millionaire
2  1726114              LullaMe
3  1475926             Book Box
4   223088       Uncharted Play

                                             tagline industry  \
0  QA Education Magazine, guide to purchasing ser...     Kids
1  Millionaire dating website that matches those ...   Dating
2  Manufacturer of self-rocking baby mattress for...     Kids
3                                           Book Box     Kids
4                                                NaN     Kids

        industry_2  type                                      address  \
0              NaN     2                      United Kingdom, Chorley
1              NaN     2                     United States, Las Vegas
2           Health     2  Kuortanegatan 2, 00510 Helsingfors, Finland
3  Wellness Beauty     2                          02000 Kiev, Ukraine
4              NaN     2                      United States, New York

          street street_number    zip         country         city  \
0            NaN           NaN  PR7 2  United Kingdom      Chorley
1            NaN           NaN    NaN   United States    Las Vegas
2  Kuortanegatan             2  00510         Finland  Helsingfors
3            NaN           NaN  02000         Ukraine         Kiev
4            NaN           NaN  10007   United States     New York

                                             sectors
0                                                NaN
1                                                NaN
2  femtech,automated process,outside tech,Automat...
3                                    Human Resources
4                                                NaN

In [4]:
#checking the dimensions
dup_data.shape

(15896, 13)

In [5]:
#to understand the data better
dup_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15896 entries, 0 to 15895
Data columns (total 13 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             15896 non-null  int64
 1   name           15896 non-null  object
 2   tagline        14972 non-null  object
 3   industry       11495 non-null  object
 4   industry_2     2591 non-null   object
 5   type           15896 non-null  int64
 6   address        15896 non-null  object
 7   street         4286 non-null   object
 8   street_number  2893 non-null   object
 9   zip            7283 non-null   object
 10  country        15896 non-null  object
 11  city           15896 non-null  object
 12  sectors        9810 non-null   object
dtypes: int64(2), object(11)
memory usage: 1.6+ MB

In [7]:
#check null values
dup_data.isnull().sum()

id                   0
name                 0
tagline            924
industry          4401
industry_2       13305
type                 0
address              0
street           11610
street_number    13003
zip               8613
country              0
city                 0
sectors           6086
dtype: int64

In [16]:
#identifying how many duplicates there are
dup = dup_data.duplicated(keep = False)
print(dup.sum())

2

In [19]:
#displaying all the duplicates
d = dup_data[dup]
display(d)

,id,name,tagline,industry,industry_2,type,address,street,street_number,zip,country,city,sectors
654,867000,Swarovski Group,Homepage - Swarovski Group,NaN,NaN,4,"Switzerland, Männedorf, Alte Landstrasse, 411",Alte Landstrasse,411,8708,Switzerland,Männedorf,NaN
655,867000,Swarovski Group,Homepage - Swarovski Group,NaN,NaN,4,"Switzerland, Männedorf, Alte Landstrasse, 411",Alte Landstrasse,411,8708,Switzerland,Männedorf,NaN

In [20]:
#saving to a different file
d.to_csv("Duplicates.csv")